package lesson3;

/*
Создать класс Client (написать его на одном уровне с классом Z_HW3, т.е. Client не находится внутри Z_HW3)
Задать ему два поля:
идентификатор типа long с именем uid
значение счёта double с именем balance
В методе main класса Z_HW3 создать двух клиентов, задать значения их полям
Попробовать вывести их через System.out.println()
 */
public class Z_HW3 {
    public static void main(String[] args) {
        class Client {
            long uid;
            Client one = new 1;




        }
        System.out.println(uid);
    }
}
